tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_tim.h
/**
  * @brief TIM_CCER Register Bit Definition
  */
#define  TIM_CCER_CC1E_Pos                        (0)
#define  TIM_CCER_CC1E_Msk                        (0x01U << TIM_CCER_CC1E_Pos)                      /*!<Channel 1 input/capture output enable*/
#define  TIM_CCER_CC1P_Pos                        (1)
#define  TIM_CCER_CC1P_Msk                        (0x01U << TIM_CCER_CC1P_Pos)                      /*!<Channel 1 input/capture output polarity*/
#define  TIM_CCER_CC1NE_Pos                       (2)
#define  TIM_CCER_CC1NE_Msk                       (0x01U << TIM_CCER_CC1NE_Pos)                     /*!<Channel 1 input/capture complementary output enable*/
#define  TIM_CCER_CC1NP_Pos                       (3)
#define  TIM_CCER_CC1NP_Msk                       (0x01U << TIM_CCER_CC1NP_Pos)                     /*!<Channel 1 input/capture complementary output polarity*/
#define  TIM_CCER_CC2E_Pos                        (4)
#define  TIM_CCER_CC2E_Msk                        (0x01U << TIM_CCER_CC2E_Pos)                      /*!<Channel 2 input/capture output enable*/
#define  TIM_CCER_CC2P_Pos                        (5)
#define  TIM_CCER_CC2P_Msk                        (0x01U << TIM_CCER_CC2P_Pos)                      /*!<Channel 2 input capture output polarity*/
#define  TIM_CCER_CC2NP_Pos                       (7)
#define  TIM_CCER_CC2NP_Msk                       (0x01U << TIM_CCER_CC2NP_Pos)                     /*!<Channel 2 input/capture complementary output polarity*/
#define  TIM_CCER_CC3E_Pos                        (8)
#define  TIM_CCER_CC3E_Msk                        (0x01U << TIM_CCER_CC3E_Pos)                      /*!<Channel 3 input/capture output enable*/
#define  TIM_CCER_CC3P_Pos                        (9)
#define  TIM_CCER_CC3P_Msk                        (0x01U << TIM_CCER_CC3P_Pos)                      /*!<Channel 3 input capture output polarity*/
#define  TIM_CCER_CC3NP_Pos                       (11)
#define  TIM_CCER_CC3NP_Msk                       (0x01U << TIM_CCER_CC3NP_Pos)                     /*!<Channel 3 input/capture complementary output polarity*/
#define  TIM_CCER_CC4E_Pos                        (12)
#define  TIM_CCER_CC4E_Msk                        (0x01U << TIM_CCER_CC4E_Pos)                      /*!<Channel 4 capture/compare enable*/
#define  TIM_CCER_CC4P_Pos                        (13)
#define  TIM_CCER_CC4P_Msk                        (0x01U << TIM_CCER_CC4P_Pos)                      /*!<Channel 4 capture/compare output polarity*/
#define  TIM_CCER_CC4NP_Pos                       (15)
#define  TIM_CCER_CC4NP_Msk                       (0x01U << TIM_CCER_CC4NP_Pos)                     /*!<Channel 4 input/capture complementary output polarity*/

/**
  * @brief TIM_CNT Register Bit Definition
  */
#define  TIM_CNT_CNT_Pos                          (0)
#define  TIM_CNT_CNT_Msk                          (0xFFFFU << TIM_CNT_CNT_Pos)                      /*!<Counter value*/

/**
  * @brief TIM_PSC Register Bit Definition
  */
#define  TIM_PSC_PSC_Pos                          (0)
#define  TIM_PSC_PSC_Msk                          (0xFFFFU << TIM_PSC_PSC_Pos)                      /*!<Prescaler value*/

/**
  * @brief TIM_ARR Register Bit Definition
  */
#define  TIM_ARR_ARR_Pos                          (0)
#define  TIM_ARR_ARR_Msk                          (0xFFFFU << TIM_ARR_ARR_Pos)                      /*!<Auto reload value*/

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFU << TIM_CCR1_CCR1_Pos)                    /*!<Channel 1 capture/compare value*/

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFU << TIM_CCR2_CCR2_Pos)                    /*!<Channel 2 capture/compare value*/

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFU << TIM_CCR3_CCR3_Pos)                    /*!<Channel 3 capture/compare value*/

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR4_Pos                        (0)
#define  TIM_CCR4_CCR4_Msk                        (0xFFFFU << TIM_CCR4_CCR4_Pos)                    /*!<Channel 4 capture/compare value*/

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)                       /*!<Dead-time generator setup adjustment*/
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x03U << TIM_BDTR_LOCK_Pos)                      /*!<Lock configuration*/
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x01U << TIM_BDTR_OSSI_Pos)                      /*!<Off state selection in the idle mode*/
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x01U << TIM_BDTR_OSSR_Pos)                      /*!<Off state selection in the run mode*/
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x01U << TIM_BDTR_BKE_Pos)                       /*!<Break function enable*/
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x01U << TIM_BDTR_BKP_Pos)                       /*!<Break input polarity*/
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x01U << TIM_BDTR_AOE_Pos)                       /*!<Auto output enable*/
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x01U << TIM_BDTR_MOE_Pos)                       /*!<Main output enable*/

/**
  * @brief TIM_DCR Register Bit Definition
  */
#define  TIM_DCR_DBA_Pos                          (0)
#define  TIM_DCR_DBA_Msk                          (0x1FU << TIM_DCR_DBA_Pos)                        /*!<DMA base address*/
#define  TIM_DCR_DBL_Pos                          (8)
#define  TIM_DCR_DBL_Msk                          (0x1FU << TIM_DCR_DBL_Pos)                        /*!<DMA continuous transmission length*/

/**
  * @brief TIM_DMAR Register Bit Definition
  */
#define  TIM_DMAR_DMAB_Pos                        (0)
#define  TIM_DMAR_DMAB_Msk                        (0xFFFFU << TIM_DMAR_DMAB_Pos)                    /*!<DMA register for burst accesses*/

/**
  * @brief TIM_OR Register Bit Definition
  */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x03U << TIM_OR_ETR_RMP_Pos)                     /*!<ETR remap*/
#define  TIM_OR_TI4_RMP_Pos                       (6)                                               
#define  TIM_OR_TI4_RMP_Msk                       (0x03U << TIM_OR_TI4_RMP_Pos)                     /*!<TI4 remap*/
/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x01U << TIM_BKINF_BKINFE_Pos)                   /*!<Break input filter enable*/
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0x0FU << TIM_BKINF_BKINF_Pos)                    /*!<Break input filter*/
#define  TIM_BKINF_IOBKIN_SEL_Pos                 (6)
#define  TIM_BKINF_IOBKIN_SEL_Msk                 (0x01U << TIM_BKINF_IOBKIN_SEL_Pos)               /*!<IO break input channel selects*/
#define  TIM_BKINF_COMPBKIN_SEL_Pos               (7)
#define  TIM_BKINF_COMPBKIN_SEL_Msk               (0x01U << TIM_BKINF_COMPBKIN_SEL_Pos)             /*!<COMP break input channel selects*/


#endif

